ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l210x/TIMB0_1.0.xml
        <register id="TIMB0_GEN_EVENT_RIS" width="32" offset="0x10" description="Raw interrupt status. Reflects all pending interrupts, regardless of masking. The RIS register allows the user to implement a poll scheme. A flag set in this register can be cleared by writing 1 to the ICLR register bit even if the corresponding IMASK bit is not enabled.">
            <bitfield id="CNT0OVF" description="Counter 0 Period match flag" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT0STRT" description="Counter 0 start event flag" begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT0STOP" description="Counter 0 stop event flag" begin="2" end="2" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT1OVF" description="Counter 1 Period match flag" begin="3" end="3" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT1STRT" description="Counter 1 start event flag" begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT1STOP" description="Counter 1 stop event flag" begin="5" end="5" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT2OVF" description="Counter 2 Period match flag" begin="6" end="6" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT2STRT" description="Counter 2 start event flag" begin="7" end="7" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT2STOP" description="Counter 2 stop event flag" begin="8" end="8" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT3OVF" description="Counter 3 Period match flag" begin="9" end="9" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT3STRT" description="Counter 3 start event flag" begin="10" end="10" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT3STOP" description="Counter 3 stop event flag" begin="11" end="11" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT4OVF" description="Counter 4 Period match flag" begin="12" end="12" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT4STRT" description="Counter 4 start event flag" begin="13" end="13" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT4STOP" description="Counter 4 stop event flag" begin="14" end="14" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT5OVF" description="Counter 5 Period match flag" begin="15" end="15" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT5STRT" description="Counter 5 start event flag" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT5STOP" description="Counter 5 stop event flag" begin="17" end="17" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT6OVF" description="Counter 6 Period match flag" begin="18" end="18" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT6STRT" description="Counter 6 start event flag" begin="19" end="19" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT6STOP" description="Counter 6 stop event flag" begin="20" end="20" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT7OVF" description="Counter 7 Period match flag" begin="21" end="21" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT7STRT" description="Counter 7 start event flag" begin="22" end="22" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="CNT7STOP" description="Counter 7 stop event flag" begin="23" end="23" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
        </register>
